[
{"id":1,"word":"basic","pos":"adj","meaning":"基本的な","example":"He learned the basic rules for starting an easy conversation in English."},
{"id":2,"word":"carry","pos":"v","meaning":"運ぶ","example":"She carried the heavy box across the room without asking for help."},
{"id":3,"word":"bright","pos":"adj","meaning":"明るい","example":"The bright colors of the festival decorations attracted many visitors."},
{"id":4,"word":"reach","pos":"v","meaning":"到達する","example":"We reached the station just before the last train departed for the night."},
{"id":5,"word":"choose","pos":"v","meaning":"選ぶ","example":"You should choose the dish that best matches your personal taste."},
{"id":6,"word":"clean","pos":"v","meaning":"掃除する","example":"He cleaned his desk carefully before starting the new project."},
{"id":7,"word":"sound","pos":"n","meaning":"音","example":"The sound of the waves made everyone feel relaxed on the beach."},
{"id":8,"word":"ready","pos":"adj","meaning":"準備ができている","example":"She was ready to leave the house as soon as the rain stopped falling."},
{"id":9,"word":"quick","pos":"adj","meaning":"素早い","example":"He gave a quick answer because he had already prepared his opinion."},
{"id":10,"word":"helpful","pos":"adj","meaning":"役に立つ","example":"The guide was very helpful when we asked for restaurant recommendations nearby."},
{"id":11,"word":"simple","pos":"adj","meaning":"簡単な","example":"The instructions were simple enough for all new members to follow easily."},
{"id":12,"word":"enjoy","pos":"v","meaning":"楽しむ","example":"They enjoyed the picnic even though the weather was slightly cloudy that day."},
{"id":13,"word":"visit","pos":"v","meaning":"訪れる","example":"We visited a small village where traditional crafts are still practiced daily."},
{"id":14,"word":"guess","pos":"v","meaning":"推測する","example":"He guessed the answer based on the hints given during the lecture."},
{"id":15,"word":"share","pos":"v","meaning":"共有する","example":"The group shared their ideas openly to improve the upcoming event."},
{"id":16,"word":"cover","pos":"v","meaning":"覆う","example":"The snow covered the streets completely by early morning."},
{"id":17,"word":"match","pos":"v","meaning":"合う","example":"The color of the shirt matched the shoes perfectly for the ceremony."},
{"id":18,"word":"break","pos":"v","meaning":"壊す","example":"He accidentally broke the glass while washing the dishes at home."},
{"id":19,"word":"move","pos":"v","meaning":"動く","example":"The car moved slowly through the narrow, crowded streets of the city."},
{"id":20,"word":"train","pos":"v","meaning":"訓練する","example":"She trained every day to prepare for the school marathon next month."}
]
